Revit 2027 API
ParameterTypeId.ViewScaleCustomname Property
 "Display Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewScaleCustomname { get; }
Public Shared ReadOnly Property ViewScaleCustomname As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewScaleCustomname {
	ForgeTypeId^ get ();
}
static member ViewScaleCustomname : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace